# -*- coding: utf-8 -*-
from __future__ import unicode_literals
BN_IPA = {'অ':'ɔ', 'আ':'a', 'ই':'i', 'ঈ':'iː', 'উ':'u', 'ঊ':'uː',
          '্':'',  'া':'a', 'ি':'i', 'ী':'iː', 'ু':'u', 'ূ':'uː',
          'ঋ':'ri', 'এ':'e', 'ঐ':'oj', 'ও':'o', 'ঔ':'ow',
          'ৃ':'ri', 'ে':'e', 'ৈ':'oj', 'ো':'o', 'ৌ':'ow',
          'ক':'k',  'খ':'kʰ',  'গ':'g',  'ঘ':'ɡʱ',  'ঙ':'ŋ',
          'চ':'tʃ', 'ছ':'tʃʰ', 'জ':'dʒ', 'ঝ':'dʒʰ', 'ঞ':'n',
          'ট':'ʈ',  'ঠ':'ʈʰ',  'ড':'ɖ',  'ঢ':'ɖʰ',  'ণ':'ɳ',
          'ত':'t̪', 'থ':'t̪ʰ', 'দ':'d̪',  'ধ':'d̪ʰ',  'ন':'n',
          'প':'p',  'ফ':'pʰ',  'ব':'b',  'ভ':'b', 'ম':'m',
          'য':'dz', 'র':'r', 'ল':'l',
          'শ':'ʃ', 'ষ':'ʂ', 'স':'s', 'হ':'ɦ',
          'ড়':'ɾ', 'ঢ়':'ɽʱ', 'য়':'e̯',
          'ৎ':'t̪', 'ং':'ŋ', 'ঃ':'h','ঁ':'◌̃'}

def bnIPA(bengali):
  ipa = ''
  for b in bengali:
    print b

  return ipa

print bnIPA("সাধ")