var BN_XLIT = {
  'অ':'a', 'আ':'ā', 'ই':'i', 'ঈ':'ī', 'উ':'u', 'ঊ':'ū',  
  'ঋ':'ri', 'ৠ':'rī', 'ঌ':'li', 'ৡ':'lī', 
  'এ':'e', 'ঐ':'ai', 'ও':'o', 'ঔ':'au',
  'া':'ā', 'ি':'i', 'ী':'ī', 'ু':'u', 'ূ':'ū',  
  'ৃ':'ri', 'ৄ':'rī', 'ৢ':'li', 'ৣ':'lī', 
  'ে':'e', 'ৈ':'ai', 'ো':'o', 'ৌ':'au',
  'ক':'k',  'খ':'kh',  'গ':'g',  'ঘ':'ɡh',  'ঙ':'ng',
  'চ':'c', 'ছ':'ch', 'জ':'j', 'ঝ':'jh', 'ঞ':'ñ',
  'ট':'ṭ',  'ঠ':'ṭh',  'ড':'ḍ',  'ঢ':'ḍh',  'ণ':'ṇ',
  'ত':'t', 'থ':'th', 'দ':'d',  'ধ':'dh',  'ন':'n',
  'প':'p',  'ফ':'ph',  'ব':'b',  'ভ':'bh', 'ম':'m',
  'য':'j', 'র':'r', 'ৰ':'r', 'ল':'l', 'ৱ':'w',
  'শ':'sh', 'ষ':'ṣ', 'স':'s', 'হ':'h',
  'ড়':'ṛ', 'ঢ়':'ṛh', 'য়':'ẏ',
  'ৎ':'t', 'ং':'ng', 'ঃ':'ḥ','ঁ':'̃','্':'', 'ঽ':'’',
  '\'':'a', ':':'ô', '্য':'y', '্যা':'æ', '@':'æ',
  'র‌্য':'ry', 'র্য':'rj',
  'জ়':'z', 'ব়':'w'
};

var BN_XLIT_BA = {
  'অ':'a', 'আ':'ā', 'ই':'i', 'ঈ':'ī', 'উ':'u', 'ঊ':'ū',  
  'ঋ':'ri', 'ৠ':'rī', 'ঌ':'li', 'ৡ':'lī', 
  'এ':'e', 'ঐ':'ai', 'ও':'o', 'ঔ':'au',
  'া':'ā', 'ি':'i', 'ী':'ī', 'ু':'u', 'ূ':'ū',  
  'ৃ':'ri', 'ৄ':'rī', 'ৢ':'li', 'ৣ':'lī', 
  'ে':'e', 'ৈ':'ai', 'ো':'o', 'ৌ':'au',
  'ক':'k',  'খ':'kh',  'গ':'g',  'ঘ':'ɡh',  'ঙ':'ng',
  'চ':'c', 'ছ':'ch', 'জ':'j', 'ঝ':'jh', 'ঞ':'ñ',
  'ট':'ṭ',  'ঠ':'ṭh',  'ড':'ḍ',  'ঢ':'ḍh',  'ণ':'ṇ',
  'ত':'t', 'থ':'th', 'দ':'d',  'ধ':'dh',  'ন':'n',
  'প':'p',  'ফ':'ph',  'ব':'b',  'ভ':'bh', 'ম':'m',
  'য':'j', 'র':'r', 'ৰ':'r', 'ল':'l', 'ৱ':'w',
  'শ':'sh', 'ষ':'ṣ', 'স':'s', 'হ':'h',
  'ড়':'ṛ', 'ঢ়':'ṛh', 'য়':'ẏ',
  'ৎ':'t', 'ং':'ng', 'ঃ':'ḥ','ঁ':'̃','্':'', 'ঽ':'’',
  '\'':'a', ':':'ô', '্য':'y', '্যা':'æ', '@':'æ',
  'র‌্য':'ry', 'র্য':'rj',
  'জ়':'z', 'ব়':'w'
};

var BN_XLIT_BA2 = {
  'অ':'a', 'আ':'ā', 'ই':'i', 'ঈ':'ī', 'উ':'u', 'ঊ':'ū',  
  'ঋ':'ri', 'ৠ':'rī', 'ঌ':'li', 'ৡ':'lī', 
  'এ':'e', 'ঐ':'a͜i', 'ও':'o', 'ঔ':'a͜u',
  'া':'ā', 'ি':'i', 'ী':'ī', 'ু':'u', 'ূ':'ū',  
  'ৃ':'ri', 'ৄ':'rī', 'ৢ':'li', 'ৣ':'lī', 
  'ে':'e', 'ৈ':'a͜i', 'ো':'o', 'ৌ':'a͜u',
  'ক':'k',  'খ':'kh',  'গ':'g',  'ঘ':'ɡh',  'ঙ':'ng',
  'চ':'c', 'ছ':'ch', 'জ':'j', 'ঝ':'jh', 'ঞ':'ñ',
  'ট':'ṭ',  'ঠ':'ṭh',  'ড':'ḍ',  'ঢ':'ḍh',  'ণ':'ṇ',
  'ত':'t', 'থ':'th', 'দ':'d',  'ধ':'dh',  'ন':'n',
  'প':'p',  'ফ':'ph',  'ব':'b',  'ভ':'bh', 'ম':'m',
  'য':'j', 'র':'r', 'ৰ':'r', 'ল':'l', 'ৱ':'w',
  'শ':'sh', 'ষ':'ṣ', 'স':'s', 'হ':'h',
  'ড়':'ṛ', 'ঢ়':'ṛh', 'য়':'ẏ',
  'ৎ':'t', 'ং':'ng', 'ঃ':'ḥ','ঁ':'̃','্':'', 'ঽ':'’',
  '\'':'a', ':':'ô', '্য':'y', '্যা':'æ', '@':'æ',
  'র‌্য':'ry', 'র্য':'rj',
  'জ়':'z', 'ব়':'w'
};

var BN_XLIT_ISO = {
  'অ':'a', 'আ':'ā', 'ই':'i', 'ঈ':'ī', 'উ':'u', 'ঊ':'ū',
  'ঋ':'r̥', 'ৠ':'r̥̄', 'ঌ':'l̥', 'ৡ':'l̥̄', 
  'এ':'e', 'ঐ':'ai', 'ও':'o', 'ঔ':'au',
  'া':'ā', 'ি':'i', 'ী':'ī', 'ু':'u', 'ূ':'ū',
  'ৃ':'r̥', 'ৄ':'r̥̄', 'ৢ':'l̥', 'ৣ':'l̥̄', 
  'ে':'e', 'ৈ':'ai', 'ো':'o', 'ৌ':'au',
  'ক':'k',  'খ':'kh',  'গ':'g',  'ঘ':'ɡh',  'ঙ':'ṅ',
  'চ':'c', 'ছ':'ch', 'জ':'j', 'ঝ':'jh', 'ঞ':'ñ',
  'ট':'ṭ',  'ঠ':'ṭh',  'ড':'ḍ',  'ঢ':'ḍh',  'ণ':'ṇ',
  'ত':'t', 'থ':'th', 'দ':'d',  'ধ':'dh',  'ন':'n',
  'প':'p',  'ফ':'ph',  'ব':'b',  'ভ':'bh', 'ম':'m',
  'য':'y', 'র':'r', 'ৰ':'r', 'ল':'l', 'ৱ':'v',
  'শ':'ś', 'ষ':'ṣ', 'স':'s', 'হ':'h',
  'ড়':'ṛ', 'ঢ়':'ṛh', 'য়':'ẏ',
  'ৎ':'t', 'ং':'ṁ', 'ঃ':'ḥ', 'ঁ':'m̐', '্':'', 'ঽ':'’',
  '\'':'a', ':':'a', '্য':'y', '্যা':'æ', '@':'æ',
  'র‌্য':'ry', 'র্য':'rj',
  'জ়':'z', 'ব়':'w'
};

var BN_XLIT_NLK = {
  'অ':'a', 'আ':'ā', 'ই':'i', 'ঈ':'ī', 'উ':'u', 'ঊ':'ū',
  'ঋ':'ṛ', 'ৠ':'ṝ', 'ঌ':'ḷ', 'ৡ':'ḹ', 
  'এ':'ē', 'ঐ':'ai', 'ও':'ō', 'ঔ':'au',
  'া':'ā', 'ি':'i', 'ী':'ī', 'ু':'u', 'ূ':'ū',
  'ৃ':'ṛ', 'ৄ':'ṝ', 'ৢ':'ḷ', 'ৣ':'ḹ', 
  'ে':'ē', 'ৈ':'ai', 'ো':'ō', 'ৌ':'au',
  'ক':'k',  'খ':'kh',  'গ':'g',  'ঘ':'ɡh',  'ঙ':'ṅ',
  'চ':'c', 'ছ':'ch', 'জ':'j', 'ঝ':'jh', 'ঞ':'ñ',
  'ট':'ṭ',  'ঠ':'ṭh',  'ড':'ḍ',  'ঢ':'ḍh',  'ণ':'ṇ',
  'ত':'t', 'থ':'th', 'দ':'d',  'ধ':'dh',  'ন':'n',
  'প':'p',  'ফ':'ph',  'ব':'b',  'ভ':'bh', 'ম':'m',
  'য':'ẏ', 'র':'r', 'ৰ':'r', 'ল':'l', 'ৱ':'v',
  'শ':'ś', 'ষ':'ṣ', 'স':'s', 'হ':'h',
  'ড়':'ḍ', 'ঢ়':'ḍh', 'য়':'y',
  'ৎ':'t', 'ং':'ṃ', 'ঃ':'ḥ', 'ঁ':'ṃ', '্':'', 'ঽ':'’',
  '\'':'a', ':':'a', '্য':'y', '্যা':'æ', '@':'æ',
  'র‌্য':'ry', 'র্য':'rẏ',
  'জ়':'z', 'ব়':'v'
};

var BN_XLIT_IAST = {
  'অ':'a', 'আ':'ā', 'ই':'i', 'ঈ':'ī', 'উ':'u', 'ঊ':'ū',
  'ঋ':'ṛ', 'ৠ':'ṝ', 'ঌ':'ḷ', 'ৡ':'ḹ', 
  'এ':'e', 'ঐ':'ai', 'ও':'o', 'ঔ':'au',
  'া':'ā', 'ি':'i', 'ী':'ī', 'ু':'u', 'ূ':'ū',
  'ৃ':'ṛ', 'ৄ':'ṝ', 'ৢ':'ḷ', 'ৣ':'ḹ', 
  'ে':'e', 'ৈ':'ai', 'ো':'o', 'ৌ':'au',
  'ক':'k',  'খ':'kh',  'গ':'g',  'ঘ':'ɡh',  'ঙ':'ṅ',
  'চ':'c', 'ছ':'ch', 'জ':'j', 'ঝ':'jh', 'ঞ':'ñ',
  'ট':'ṭ',  'ঠ':'ṭh',  'ড':'ḍ',  'ঢ':'ḍh',  'ণ':'ṇ',
  'ত':'t', 'থ':'th', 'দ':'d',  'ধ':'dh',  'ন':'n',
  'প':'p',  'ফ':'ph',  'ব':'b',  'ভ':'bh', 'ম':'m',
  'য':'ẏ', 'র':'r', 'ৰ':'r', 'ল':'l', 'ৱ':'v',
  'শ':'ś', 'ষ':'ṣ', 'স':'s', 'হ':'h',
  'ড়':'ḍ', 'ঢ়':'ḍh', 'য়':'y',
  'ৎ':'t', 'ং':'ṃ', 'ঃ':'ḥ', 'ঁ':'ṃ', '্':'', 'ঽ':'’',
  '\'':'a', ':':'a', '্য':'y', '্যা':'æ', '@':'æ',
  'র‌্য':'ry', 'র্য':'rẏ',
  'জ়':'z', 'ব়':'v'
};

var SPECIALS = {
  'র‌্য':'র+‌+্+য', 'র্য':'র+্+য', '্যা':'্+য+া', '্য':'্+য'
}
var BANJON = [
  'ক', 'খ', 'গ', 'ঘ', 'ঙ', 'চ', 'ছ', 'জ', 'ঝ', 'ঞ',
  'ট', 'ঠ', 'ড', 'ঢ', 'ণ', 'ত', 'থ', 'দ', 'ধ', 'ন',
  'প', 'ফ', 'ব', 'ভ', 'ম', 'য', 'র', 'ল',
  'শ', 'ষ', 'স', 'হ'];
var KAAR = ['\'', ':', '্', 'া', 'ি', 'ী', 'ু', 'ূ',
  'ৃ', 'ৄ', 'ৢ', 'ৣ', 'ে', 'ৈ', 'ো', 'ৌ', '+'];


function bnXlit(bengali, xlitMap, inherent){
  for (var special in SPECIALS){
    bengali = replaceAll(special,SPECIALS[special],bengali);
  }
  var xlit="";
  for (var i = 0, len = bengali.length; i < len; i++) {
    var b = bengali[i];
    while(bengali[i+1]=='+'){
      b+=bengali[i+2];
      i+=2;
	}
    if (b in xlitMap) x = xlitMap[b];
    else x = b;
    xlit+=x;
    if( ($.inArray(bengali[i], BANJON)>=0) && ($.inArray(bengali[1+i],KAAR)<0) )
      xlit+=inherent;
  }
  return xlit;
}

function bnXlitRef(){
  var ref="";
  for (var bn in BN_XLIT){
    x = BN_XLIT[bn]
    ref+="<span class='ref'><span class='bn'>"+bn+"</span><span class='xt'>"+x+"</span></span> ";
  }
  return ref;
}