var BN_XLIT = {
  'অ':'a', 'আ':'ā', 'ই':'i', 'ঈ':'ī', 'উ':'u', 'ঊ':'ū',  
  'ঋ':'ri', 'ৠ':'rī', 'ঌ':'li', 'ৡ':'lī', 
  'এ':'e', 'ঐ':'ai', 'ও':'o', 'ঔ':'au',
  'া':'ā', 'ি':'i', 'ী':'ī', 'ু':'u', 'ূ':'ū',  
  'ৃ':'ri', 'ৄ':'rī', 'ৢ':'li', 'ৣ':'lī', 
  'ে':'e', 'ৈ':'ai', 'ো':'o', 'ৌ':'au',
  'ক':'k',  'খ':'kh',  'গ':'g',  'ঘ':'ɡh',  'ঙ':'ng',
  'চ':'c', 'ছ':'ch', 'জ':'j', 'ঝ':'jh', 'ঞ':'ñ',
  'ট':'ṭ',  'ঠ':'ṭh',  'ড':'ḍ',  'ঢ':'ḍh',  'ণ':'ṇ',
  'ত':'t', 'থ':'th', 'দ':'d',  'ধ':'dh',  'ন':'n',
  'প':'p',  'ফ':'ph',  'ব':'b',  'ভ':'bh', 'ম':'m',
  'য':'j', 'র':'r', 'ৰ':'r', 'ল':'l', 'ৱ':'w',
  'শ':'sh', 'ষ':'ṣ', 'স':'s', 'হ':'h',
  'ড়':'ṛ', 'ঢ়':'ṛh', 'য়':'ẏ',
  'ৎ':'t', 'ং':'ng', 'ঃ':'ḥ','ঁ':'̃', '্':'','্‌':'', 'ঽ':'’',
  '\'':'', ':':'ô', '‌্য':'y', '‌্যা':'æ', '@':'æ',
  'র‌্য':'ry', 'র্য':'rj',
  'জ়':'z', 'ব়':'w'
};

var BN_XLIT_BA = {
  'অ':'a', 'আ':'ā', 'ই':'i', 'ঈ':'ī', 'উ':'u', 'ঊ':'ū',  
  'ঋ':'ri', 'ৠ':'rī', 'ঌ':'li', 'ৡ':'lī', 
  'এ':'e', 'ঐ':'ai', 'ও':'o', 'ঔ':'au',
  'া':'ā', 'ি':'i', 'ী':'ī', 'ু':'u', 'ূ':'ū',  
  'ৃ':'ri', 'ৄ':'rī', 'ৢ':'li', 'ৣ':'lī', 
  'ে':'e', 'ৈ':'ai', 'ো':'o', 'ৌ':'au',
  'ক':'k',  'খ':'kh',  'গ':'g',  'ঘ':'ɡh',  'ঙ':'ng',
  'চ':'c', 'ছ':'ch', 'জ':'j', 'ঝ':'jh', 'ঞ':'ñ',
  'ট':'ṭ',  'ঠ':'ṭh',  'ড':'ḍ',  'ঢ':'ḍh',  'ণ':'ṇ',
  'ত':'t', 'থ':'th', 'দ':'d',  'ধ':'dh',  'ন':'n',
  'প':'p',  'ফ':'ph',  'ব':'b',  'ভ':'bh', 'ম':'m',
  'য':'j', 'র':'r', 'ৰ':'r', 'ল':'l', 'ৱ':'w',
  'শ':'sh', 'ষ':'ṣ', 'স':'s', 'হ':'h',
  'ড়':'ṛ', 'ঢ়':'ṛh', 'য়':'ẏ',
  'ৎ':'t', 'ং':'ng', 'ঃ':'ḥ','ঁ':'̃', '্':'','্‌':'', 'ঽ':'’',
  '\'':'', ':':'ô', '‌্য':'y', '‌্যা':'æ', '@':'æ',
  'র‌্য':'ry', 'র্য':'rj',
  'জ়':'z', 'ব়':'w'
};

var BN_XLIT_BA2 = {
  'অ':'a', 'আ':'ā', 'ই':'i', 'ঈ':'ī', 'উ':'u', 'ঊ':'ū',  
  'ঋ':'ri', 'ৠ':'rī', 'ঌ':'li', 'ৡ':'lī', 
  'এ':'e', 'ঐ':'a͜i', 'ও':'o', 'ঔ':'a͜u',
  'া':'ā', 'ি':'i', 'ী':'ī', 'ু':'u', 'ূ':'ū',  
  'ৃ':'ri', 'ৄ':'rī', 'ৢ':'li', 'ৣ':'lī', 
  'ে':'e', 'ৈ':'a͜i', 'ো':'o', 'ৌ':'a͜u',
  'ক':'k',  'খ':'kh',  'গ':'g',  'ঘ':'ɡh',  'ঙ':'ng',
  'চ':'c', 'ছ':'ch', 'জ':'j', 'ঝ':'jh', 'ঞ':'ñ',
  'ট':'ṭ',  'ঠ':'ṭh',  'ড':'ḍ',  'ঢ':'ḍh',  'ণ':'ṇ',
  'ত':'t', 'থ':'th', 'দ':'d',  'ধ':'dh',  'ন':'n',
  'প':'p',  'ফ':'ph',  'ব':'b',  'ভ':'bh', 'ম':'m',
  'য':'j', 'র':'r', 'ৰ':'r', 'ল':'l', 'ৱ':'w',
  'শ':'sh', 'ষ':'ṣ', 'স':'s', 'হ':'h',
  'ড়':'ṛ', 'ঢ়':'ṛh', 'য়':'ẏ',
  'ৎ':'t', 'ং':'ng', 'ঃ':'ḥ','ঁ':'̃', '্':'','্‌':'', 'ঽ':'’',
  '\'':'', ':':'ô', '‌্য':'y', '‌্যা':'æ', '@':'æ',
  'র‌্য':'ry', 'র্য':'rj',
  'জ়':'z', 'ব়':'w'
};

var BN_XLIT_ISO = {
  'অ':'a', 'আ':'ā', 'ই':'i', 'ঈ':'ī', 'উ':'u', 'ঊ':'ū',
  'ঋ':'r̥', 'ৠ':'r̥̄', 'ঌ':'l̥', 'ৡ':'l̥̄', 
  'এ':'e', 'ঐ':'ai', 'ও':'o', 'ঔ':'au',
  'া':'ā', 'ি':'i', 'ী':'ī', 'ু':'u', 'ূ':'ū',
  'ৃ':'r̥', 'ৄ':'r̥̄', 'ৢ':'l̥', 'ৣ':'l̥̄', 
  'ে':'e', 'ৈ':'ai', 'ো':'o', 'ৌ':'au',
  'ক':'k',  'খ':'kh',  'গ':'g',  'ঘ':'ɡh',  'ঙ':'ṅ',
  'চ':'c', 'ছ':'ch', 'জ':'j', 'ঝ':'jh', 'ঞ':'ñ',
  'ট':'ṭ',  'ঠ':'ṭh',  'ড':'ḍ',  'ঢ':'ḍh',  'ণ':'ṇ',
  'ত':'t', 'থ':'th', 'দ':'d',  'ধ':'dh',  'ন':'n',
  'প':'p',  'ফ':'ph',  'ব':'b',  'ভ':'bh', 'ম':'m',
  'য':'y', 'র':'r', 'ৰ':'r', 'ল':'l', 'ৱ':'v',
  'শ':'ś', 'ষ':'ṣ', 'স':'s', 'হ':'h',
  'ড়':'ṛ', 'ঢ়':'ṛh', 'য়':'ẏ',
  'ৎ':'t', 'ং':'ṁ', 'ঃ':'ḥ', 'ঁ':'m̐', '্':'','্‌':'', 'ঽ':'’',
  '\'':'', ':':'a', '‌্য':'ẏ', '‌্যা':'ẏa', '@':'æ',
  'র‌্য':'rẏ', 'র্য':'ry',
  'জ়':'z', 'ব়':'w'
};

var BN_XLIT_NLK = {
  'অ':'a', 'আ':'ā', 'ই':'i', 'ঈ':'ī', 'উ':'u', 'ঊ':'ū',
  'ঋ':'ṛ', 'ৠ':'ṝ', 'ঌ':'ḷ', 'ৡ':'ḹ', 
  'এ':'ē', 'ঐ':'ai', 'ও':'ō', 'ঔ':'au',
  'া':'ā', 'ি':'i', 'ী':'ī', 'ু':'u', 'ূ':'ū',
  'ৃ':'ṛ', 'ৄ':'ṝ', 'ৢ':'ḷ', 'ৣ':'ḹ', 
  'ে':'ē', 'ৈ':'ai', 'ো':'ō', 'ৌ':'au',
  'ক':'k',  'খ':'kh',  'গ':'g',  'ঘ':'ɡh',  'ঙ':'ṅ',
  'চ':'c', 'ছ':'ch', 'জ':'j', 'ঝ':'jh', 'ঞ':'ñ',
  'ট':'ṭ',  'ঠ':'ṭh',  'ড':'ḍ',  'ঢ':'ḍh',  'ণ':'ṇ',
  'ত':'t', 'থ':'th', 'দ':'d',  'ধ':'dh',  'ন':'n',
  'প':'p',  'ফ':'ph',  'ব':'b',  'ভ':'bh', 'ম':'m',
  'য':'ẏ', 'র':'r', 'ৰ':'r', 'ল':'l', 'ৱ':'v',
  'শ':'ś', 'ষ':'ṣ', 'স':'s', 'হ':'h',
  'ড়':'ḍ', 'ঢ়':'ḍh', 'য়':'y',
  'ৎ':'t', 'ং':'ṃ', 'ঃ':'ḥ', 'ঁ':'ṃ', '্':'','্‌':'', 'ঽ':'’',
  '\'':'', ':':'a', '‌্য':'y', '‌্যা':'ya', '@':'æ',
  'র‌্য':'ry', 'র্য':'rẏ',
  'জ়':'z', 'ব়':'v'
};

var BN_XLIT_IAST = {
  'অ':'a', 'আ':'ā', 'ই':'i', 'ঈ':'ī', 'উ':'u', 'ঊ':'ū',
  'ঋ':'ṛ', 'ৠ':'ṝ', 'ঌ':'ḷ', 'ৡ':'ḹ', 
  'এ':'e', 'ঐ':'ai', 'ও':'o', 'ঔ':'au',
  'া':'ā', 'ি':'i', 'ী':'ī', 'ু':'u', 'ূ':'ū',
  'ৃ':'ṛ', 'ৄ':'ṝ', 'ৢ':'ḷ', 'ৣ':'ḹ', 
  'ে':'e', 'ৈ':'ai', 'ো':'o', 'ৌ':'au',
  'ক':'k',  'খ':'kh',  'গ':'g',  'ঘ':'ɡh',  'ঙ':'ṅ',
  'চ':'c', 'ছ':'ch', 'জ':'j', 'ঝ':'jh', 'ঞ':'ñ',
  'ট':'ṭ',  'ঠ':'ṭh',  'ড':'ḍ',  'ঢ':'ḍh',  'ণ':'ṇ',
  'ত':'t', 'থ':'th', 'দ':'d',  'ধ':'dh',  'ন':'n',
  'প':'p',  'ফ':'ph',  'ব':'b',  'ভ':'bh', 'ম':'m',
  'য':'ẏ', 'র':'r', 'ৰ':'r', 'ল':'l', 'ৱ':'v',
  'শ':'ś', 'ষ':'ṣ', 'স':'s', 'হ':'h',
  'ড়':'ḍ', 'ঢ়':'ḍh', 'য়':'y',
  'ৎ':'t', 'ং':'ṃ', 'ঃ':'ḥ', 'ঁ':'ṃ', '্':'','্‌':'', 'ঽ':'’',
  '\'':'', ':':'a', '‌্য':'y', '‌্যা':'ya', '@':'æ',
  'র‌্য':'ry', 'র্য':'rẏ',
  'জ়':'z', 'ব়':'v'
};

var BN_XLIT_ITRANS = {
  'অ':'a', 'আ':'A', 'ই':'i', 'ঈ':'I', 'উ':'u', 'ঊ':'U',
  'ঋ':'R^i', 'ৠ':'R^I', 'ঌ':'L^i', 'ৡ':'L^I', 
  'এ':'e', 'ঐ':'ai', 'ও':'o', 'ঔ':'au',
  'া':'A', 'ি':'i', 'ী':'I', 'ু':'u', 'ূ':'U',
  'ৃ':'R^i', 'ৄ':'R^I', 'ৢ':'L^i', 'ৣ':'L^I', 
  'ে':'e', 'ৈ':'ai', 'ো':'o', 'ৌ':'au',
  'ক':'k',  'খ':'kh',  'গ':'g',  'ঘ':'ɡh',  'ঙ':'N^',
  'চ':'c', 'ছ':'Ch', 'জ':'j', 'ঝ':'jh', 'ঞ':'JN',
  'ট':'T',  'ঠ':'Th',  'ড':'D',  'ঢ':'Dh',  'ণ':'n',
  'ত':'t', 'থ':'th', 'দ':'d',  'ধ':'dh',  'ন':'n',
  'প':'p',  'ফ':'ph',  'ব':'b',  'ভ':'bh', 'ম':'m',
  'য':'y', 'র':'r', 'ৰ':'r', 'ল':'l', 'ৱ':'v',
  'শ':'sh', 'ষ':'Sh', 'স':'s', 'হ':'h',
  'ড়':'.D', 'ঢ়':'.Dh', 'য়':'Y',
  'ৎ':'.t', 'ং':'.m', 'ঃ':'H', 'ঁ':'.N', '্':'','্‌':'.h', 'ঽ':'.a',
  '\'':'', ':':'a', '‌্য':'Y', '‌্যা':'YA', '@':'ae',
  'র‌্য':'rY', 'র্য':'ry',
  'জ়':'z', 'ব়':'v'
};

var BN_Anglicize = {
  'অ':'au', 'আ':'a', 'ই':'i', 'ঈ':'ee', 'উ':'u', 'ঊ':'oo',
  'ঋ':'ri', 'ৠ':'ree', 'ঌ':'li', 'ৡ':'lee', 
  'এ':'e', 'ঐ':'oi', 'ও':'o', 'ঔ':'ow',
  'া':'a', 'ি':'i', 'ী':'ee', 'ু':'u', 'ূ':'oo',
  'ৃ':'ri', 'ৄ':'ree', 'ৢ':'li', 'ৣ':'lee', 
  'ে':'e', 'ৈ':'oi', 'ো':'o', 'ৌ':'ow',
  'ক':'k',  'খ':'kh',  'গ':'g',  'ঘ':'ɡh',  'ঙ':'ng',
  'চ':'ch', 'ছ':'chh', 'জ':'j', 'ঝ':'jh', 'ঞ':'n',
  'ট':'t',  'ঠ':'th',  'ড':'d',  'ঢ':'dh',  'ণ':'n',
  'ত':'t', 'থ':'th', 'দ':'d',  'ধ':'dh',  'ন':'n',
  'প':'p',  'ফ':'ph',  'ব':'b',  'ভ':'bh', 'ম':'m',
  'য':'j', 'র':'r', 'ৰ':'r', 'ল':'l', 'ৱ':'v',
  'শ':'sh', 'ষ':'ss', 'স':'s', 'হ':'h',
  'ড়':'rr', 'ঢ়':'rh', 'য়':'y',
  'ৎ':'t', 'ং':'ng', 'ঃ':'h', 'ঁ':'', '্':'','্‌':'', 'ঽ':'’',
  '\'':'', ':':'ô', '‌্য':'y', '‌্যা':'ae', '@':'ae',
  'র‌্য':'ry', 'র্য':'rj',
  'জ়':'z', 'ব়':'v'
};


var BN_BRAHMI = {
  'অ':'𑀅', 'আ':'𑀆', 'ই':'𑀇', 'ঈ':'𑀈', 'উ':'𑀉', 'ঊ':'𑀊',
  'ঋ':'𑀋', 'ৠ':'𑀌', 'ঌ':'𑀍', 'ৡ':'𑀎',
  'এ':'𑀏', 'ঐ':'𑀐', 'ও':'𑀑', 'ঔ':'𑀒',
  'া':'𑀸', 'ি':'𑀺', 'ী':'𑀻', 'ু':'𑀼', 'ূ':'𑀽',
  'ৃ':'𑀾', 'ৄ':'𑀿', 'ৢ':'𑁀', 'ৣ':'𑁁',
  'ে':'𑁂', 'ৈ':'𑁃', 'ো':'𑁄', 'ৌ':'𑁅',
  'ক':'𑀓','খ':'𑀔',  'গ':'𑀕',  'ঘ':'𑀖',  'ঙ':'𑀗',
  'চ':'𑀘', 'ছ':'𑀙', 'জ':'𑀚', 'ঝ':'𑀛', 'ঞ':'𑀜',
  'ট':'𑀝', 'ঠ':'𑀞',  'ড':'𑀟',  'ঢ':'𑀠',  'ণ':'𑀡',
  'ত':'𑀸', 'থ':'𑀣', 'দ':'𑀤',  'ধ':'𑀥',  'ন':'𑀦',
  'প':'𑀧', 'ফ':'𑀨',  'ব':'𑀩',  'ভ':'𑀪', 'ম':'𑀫',
  'য':'𑀬', 'র':'𑀭', 'ৰ':'𑀭', 'ল':'𑀮', 'ৱ':'𑀯',
  'শ':'𑀰', 'ষ':'𑀱', 'স':'𑀲', 'হ':'𑀳',
  'ড়':'rr', 'ঢ়':'rh', 'য়':'𑀬',
  'ৎ':'𑀸', 'ং':'𑀁', 'ঃ':'𑀂', 'ঁ':'𑀀', '্':'्','্‌':'्‌', 'ঽ':'ऽ',
  '\'':'', ':':'ô', '‌্য':'𑀬', '‌্যা':'𑀬𑀸', '@':'ae',
  'র‌্য':'ry', 'র্য':'rj',
  'জ়':'z', 'ব়':'v'
};

var BN_DEVNG = {
  'অ':'अ', 'আ':'आ', 'ই':'इ', 'ঈ':'ई', 'উ':'उ', 'ঊ':'ऊ',
  'ঋ':'ऋ', 'ৠ':'ॠ', 'ঌ':'ऌ', 'ৡ':'ॡ', 
  'এ':'ए', 'ঐ':'पै', 'ও':'ओ', 'ঔ':'औ',
  'া':'ा', 'ি':'ि', 'ী':'ी', 'ু':'ु', 'ূ':'ू',
  'ৃ':'ृ', 'ৄ':'ॄ', 'ৢ':'ॢ', 'ৣ':'ॣ', 
  'ে':'े', 'ৈ':'ै', 'ো':'ॊ', 'ৌ':'ौ',
  'ক':'क',  'খ':'ख',  'গ':'ग',  'ঘ':'घ',  'ঙ':'ङ',
  'চ':'च ', 'ছ':'छ ', 'জ':'ज', 'ঝ':'झ', 'ঞ':'ञ',
  'ট':'ट',  'ঠ':'ठ',  'ড':'ड',  'ঢ':'ढ',  'ণ':'ण',
  'ত':'त', 'থ':'थ', 'দ':'द',  'ধ':'ध',  'ন':'न',
  'প':'प',  'ফ':'फ',  'ব':'ब',  'ভ':'भ', 'ম':'म',
  'য':'य', 'র':'र', 'ৰ':'र', 'ল':'ल', 'ৱ':'व',
  'শ':'श', 'ষ':'ष', 'স':'स', 'হ':'ह',
  'ড়':'ड़', 'ঢ়':'ढ़', 'য়':'य़',
  'ৎ':'त् ', 'ং':'ं', 'ঃ':'ः', 'ঁ':'ँ', '্':'्','্‌':'्‌', 'ঽ':'ऽ',
  '\'':'', ':':'', '‌্য':'्य', '‌্যা':'्या', '@':'्या',
  'র‌্য':'ऱ्य', 'র্য':'र्य',
  'জ়':'z', 'ব়':'v'
};

var BN_PERSO_ARABIC = {
  'অ':'أ', 'আ':'آ', 'ই':'ي', 'ঈ':'يِ', 'উ':'و', 'ঊ':'وِ',
  'ঋ':'رِ', 'ৠ':'رِي', 'ঌ':'لِ', 'ৡ':'لِي', 
  'এ':'اِ', 'ঐ':'أي', 'ও':'اُ', 'ঔ':'أو',
  'া':'َا', 'ি':'ِ', 'ী':'ِي', 'ু':'ُ', 'ূ':'ُو',
  'ৃ':'ْرِ', 'ৄ':'ْرِي', 'ৢ':'لِ', 'ৣ':'لِي', 
  'ে':'ِ', 'ৈ':'َيْ', 'ো':'ُ', 'ৌ':'َوْ',
  'ক':'ک',  'খ':'کھ',  'গ':'گ',  'ঘ':'گھ',  'ঙ':'ں',
  'চ':'چ', 'ছ':'چھ', 'জ':'ج', 'ঝ':'جھ', 'ঞ':'ڃ',
  'ট':'ٹ',  'ঠ':'ٹھ',  'ড':'ڈ',  'ঢ':'ڈھ',  'ণ':'ڻ',
  'ত':'ت', 'থ':'تھ', 'দ':'د',  'ধ':'دھ',  'ন':'ن',
  'প':'پ',  'ফ':'پھ',  'ব':'ب',  'ভ':'بھ', 'ম':'م',
  'য':'ز', 'র':'ر', 'ৰ':'ر', 'ল':'ل', 'ৱ':'و',
  'শ':'ش', 'ষ':'ݜ', 'স':'س', 'হ':'ح',
  'ড়':'ڑ', 'ঢ়':'ڑھ', 'য়':'ی',
  'ৎ':'ۃ', 'ং':'ں', 'ঃ':'ھ', 'ঁ':'٘', '্':'','্‌':'ْ', 'ঽ':'ع',
  '\'':'', ':':'', '‌্য':'ۧ', '‌্যা':'اۧ', '@':'آِ',
  'র‌্য':'رۧ', 'র্য':'رز',
'জ়':'ظ', 'ব়':'و', 'ফ়':'ف', 'ক়':'ق', 'খ়':'خ', 'ছ়':'ث',
'স়':'ص', 'দ়':'ض', 'ত়':'ط', 'ঝ়':'ذ', 'অ়':'ع', 'গ়':'غ'
};

var SPECIALS = {
'‌্যা':'\'‌+্+য+া', '‌্য':'\'‌+্+য', '্‌':'্+‌'
}
var BANJON = [
  'ক', 'খ', 'গ', 'ঘ', 'ঙ', 'চ', 'ছ', 'জ', 'ঝ', 'ঞ',
  'ট', 'ঠ', 'ড', 'ঢ', 'ণ', 'ত', 'থ', 'দ', 'ধ', 'ন',
  'প', 'ফ', 'ব', 'ভ', 'ম', 'য', 'র', 'ৰ', 'ল', 'ৱ',
  'শ', 'ষ', 'স', 'হ', 'ড়', 'ঢ়', 'য়'];
var KAAR = ['\'', ':', '্', 'া', 'ি', 'ী', 'ু', 'ূ',
  'ৃ', 'ৄ', 'ৢ', 'ৣ', 'ে', 'ৈ', 'ো', 'ৌ', '+', '\''];


function bnXlit(bengali, xlitMap, inherent, specials){
  if(typeof(specials)==='undefined') specials = SPECIALS;
  for (var special in specials){
    bengali = replaceAll(special,SPECIALS[special],bengali);
  }
  var xlit="";
  for (var i = 0, len = bengali.length; i < len; i++) {
    var b = bengali[i];
    while(bengali[i+1]=='+'){
      b+=bengali[i+2];
      i+=2;
	  }
    while(bengali[i+1]=='়'){
      b+=bengali[i+1];
      i+=1;
    }
    if (b in xlitMap) x = xlitMap[b];
    else x = b;
    xlit+=x;
    if( ($.inArray(bengali[i], BANJON)>=0) && ($.inArray(bengali[1+i],KAAR)<0) )
      xlit+=inherent;
  }
  return xlit;
}

function bnXlitRef(){
  var ref="";
  for (var bn in BN_XLIT){
    x = BN_XLIT[bn]
    ref+="<span class='ref'><span class='bn'>"+bn+"</span><span class='xt'>"+x+"</span></span> ";
  }
  return ref;
}